In [1]:
import mysql.connector as conn
import pandas as pd

In [2]:
crea_db=conn.connect(host='localhost',
                     user='root',
                     passwd=open("../waka.txt", "r").read())

cursor=crea_db.cursor()

cursor.execute('drop database if exists productos')
cursor.execute('create database productos')

In [3]:
cursor.execute('show databases')

for x in cursor:
    print(x)

('information_schema',)
('my_db5',)
('my_db6',)
('mysql',)
('performance_schema',)
('productos',)
('publication',)
('sys',)

In [4]:
db=conn.connect(host='localhost',
                     user='root',
                     passwd=open("../waka.txt", "r").read(),
                     database='publication')

cursor=db.cursor()

In [5]:
cursor

In [6]:
cursor.execute('show tables')

for x in cursor:
    print(x)

('authors',)
('discounts',)
('employee',)
('jobs',)
('pub_info',)
('publishers',)
('roysched',)
('sales',)
('stores',)
('titleauthor',)
('titles',)

In [7]:
cursor.execute(
   '''SELECT  a.au_id AS "AUTHOR ID",  tl.price AS "price",   tl.title AS "Title",
tl.price * sa.qty * tl.royalty / 100 * ta.royaltyper / 100 AS "royal sales"
	FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id  
    LEFT JOIN titles AS tl ON tl.title_id = ta.title_id 
    LEFT JOIN publishers AS pb ON pb.pub_id = tl.pub_id 
    LEFT JOIN sales AS sa ON sa.title_id = ta.title_id'''

)

for x in cursor:
    print(x)

('172-32-1176', Decimal('19.9900'), 'Prolonged Data Deprivation: Four Case Studies', Decimal('29.985000000000'))
('213-46-8915', Decimal('19.9900'), "The Busy Executive's Database Guide", Decimal('3.998000000000'))
('213-46-8915', Decimal('19.9900'), "The Busy Executive's Database Guide", Decimal('7.996000000000'))
('213-46-8915', Decimal('2.9900'), 'You Can Combat Computer Stress!', Decimal('25.116000000000'))
('238-95-7766', Decimal('22.9500'), 'But Is It User Friendly?', Decimal('110.160000000000'))
('267-41-2394', Decimal('11.9500'), 'Cooking with Computers: Surreptitious Balance Sheets', Decimal('11.950000000000'))
('267-41-2394', Decimal('14.9900'), 'Sushi, Anyone?', Decimal('8.994000000000'))
('274-80-9391', Decimal('19.9900'), 'Straight Talk About Computers', Decimal('29.985000000000'))
('341-22-1782', None, None, None)
('409-56-7008', Decimal('19.9900'), "The Busy Executive's Database Guide", Decimal('5.997000000000'))
('409-56-7008', Decimal('19.9900'), "The Busy Executive's Database Guide", Decimal('11.994000000000'))
('427-17-2319', Decimal('20.0000'), 'Secrets of Silicon Valley', Decimal('50.000000000000'))
('472-27-2349', Decimal('14.9900'), 'Sushi, Anyone?', Decimal('8.994000000000'))
('486-29-1786', None, 'Net Etiquette', None)
('486-29-1786', Decimal('7.9900'), 'Emotional Security: A New Algorithm', Decimal('19.975000000000'))
('527-72-3246', None, None, None)
('648-92-1872', Decimal('11.9500'), 'Fifty Years in Buckingham Palace Kitchens', Decimal('33.460000000000'))
('672-71-3249', Decimal('14.9900'), 'Sushi, Anyone?', Decimal('11.992000000000'))
('712-45-1867', Decimal('19.9900'), 'Silicon Valley Gastronomic Treats', Decimal('23.988000000000'))
('722-51-5454', Decimal('2.9900'), 'The Gourmet Microwave', Decimal('13.455000000000'))
('722-51-5454', Decimal('2.9900'), 'The Gourmet Microwave', Decimal('8.073000000000'))
('724-08-9931', None, None, None)
('724-80-9391', Decimal('11.9500'), 'Cooking with Computers: Surreptitious Balance Sheets', Decimal('17.925000000000'))
('724-80-9391', Decimal('21.5900'), 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', Decimal('10.795000000000'))
('756-30-7391', Decimal('21.5900'), 'Computer Phobic AND Non-Phobic Individuals: Behavior Variations', Decimal('32.385000000000'))
('807-91-6654', Decimal('20.9500'), 'Onions, Leeks, and Garlic: Cooking Secrets of the Mediterranean', Decimal('83.800000000000'))
('846-92-7186', Decimal('20.0000'), 'Secrets of Silicon Valley', Decimal('50.000000000000'))
('893-72-1158', None, None, None)
('899-46-2035', Decimal('2.9900'), 'The Gourmet Microwave', Decimal('4.485000000000'))
('899-46-2035', Decimal('2.9900'), 'The Gourmet Microwave', Decimal('2.691000000000'))
('899-46-2035', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('1.971000000000'))
('899-46-2035', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('49.275000000000'))
('899-46-2035', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('6.570000000000'))
('899-46-2035', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('13.140000000000'))
('998-72-3567', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('1.971000000000'))
('998-72-3567', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('49.275000000000'))
('998-72-3567', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('6.570000000000'))
('998-72-3567', Decimal('10.9500'), 'Is Anger the Enemy?', Decimal('13.140000000000'))
('998-72-3567', Decimal('7.0000'), 'Life Without Fear', Decimal('17.500000000000'))

In [8]:


tabla1='''SELECT  a.au_id AS "AUTHOR ID",  tl.title AS "Title",
tl.price * sa.qty * tl.royalty / 100 * ta.royaltyper / 100 AS "royal_sales",
	FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id  
    LEFT JOIN titles AS tl ON tl.title_id = ta.title_id 
    LEFT JOIN publishers AS pb ON pb.pub_id = tl.pub_id 
    LEFT JOIN sales AS sa ON sa.title_id = ta.title_id
    
	'''
cursor.execute(tabla1)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id
    LE' at line 3

In [9]:
db=conn.connect(host='localhost',
                     user='root',
                     passwd=open("../waka.txt", "r").read(),
                     database='publication')

cursor=db.cursor()

In [10]:
pd.read_sql(tabla1,db)

DatabaseError: Execution failed on sql 'SELECT  a.au_id AS "AUTHOR ID",  tl.title AS "Title",
tl.price * sa.qty * tl.royalty / 100 * ta.royaltyper / 100 AS "royal_sales",
	FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id
    LEFT JOIN titles AS tl ON tl.title_id = ta.title_id
    LEFT JOIN publishers AS pb ON pb.pub_id = tl.pub_id
    LEFT JOIN sales AS sa ON sa.title_id = ta.title_id

	': 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id
    LE' at line 3

In [ ]:
tabla2='''Select * from 
(SELECT  a.au_id AS "AUTHOR ID",  tl.price AS "price",   tl.title AS "Title",
sum(tl.price * sa.qty * tl.royalty / 100 * ta.royaltyper / 100) AS "royal_sales"
	FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id  
    LEFT JOIN titles AS tl ON tl.title_id = ta.title_id 
    LEFT JOIN publishers AS pb ON pb.pub_id = tl.pub_id 
    LEFT JOIN sales AS sa ON sa.title_id = ta.title_id
     group by a.au_id) as tabla2

group by Title'''
cursor.execute(tabla2)

In [11]:
db=conn.connect(host='localhost',
                     user='root',
                     passwd=open("../waka.txt", "r").read(),
                     database='publication')

cursor=db.cursor()

In [12]:
pd.read_sql(tabla2,db)

NameError: name 'tabla2' is not defined

In [13]:
tabla3='''Select * from 

(SELECT  a.au_id AS "AUTHOR ID",  tl.price AS "price",   tl.title AS "Title",
sum(tl.price * sa.qty * tl.royalty / 100 * ta.royaltyper / 100) AS "royal_sales"
	FROM authors AS a
    LEFT JOIN titleauthor AS ta ON a.au_id = ta.au_id  
    LEFT JOIN titles AS tl ON tl.title_id = ta.title_id 
    LEFT JOIN publishers AS pb ON pb.pub_id = tl.pub_id 
    LEFT JOIN sales AS sa ON sa.title_id = ta.title_id
     group by tl.title) as tabla3
'''
cursor.execute(tabla3)

In [14]:
db=conn.connect(host='localhost',
                     user='root',
                     passwd=open("../waka.txt", "r").read(),
                     database='publication')

cursor=db.cursor()

In [15]:
pd.read_sql(tabla3,db)

,AUTHOR ID,price,Title,royal_sales
0,172-32-1176,19.99,Prolonged Data Deprivation: Four Case Studies,29.985
1,213-46-8915,19.99,The Busy Executive's Database Guide,29.985
2,213-46-8915,2.99,You Can Combat Computer Stress!,25.116
3,238-95-7766,22.95,But Is It User Friendly?,110.160
4,267-41-2394,11.95,Cooking with Computers: Surreptitious Balance ...,29.875
5,267-41-2394,14.99,"Sushi, Anyone?",29.980
6,274-80-9391,19.99,Straight Talk About Computers,29.985
7,341-22-1782,NaN,None,NaN
8,427-17-2319,20.00,Secrets of Silicon Valley,100.000
9,486-29-1786,NaN,Net Etiquette,NaN
10,486-29-1786,7.99,Emotional Security: A New Algorithm,19.975
11,648-92-1872,11.95,Fifty Years in Buckingham Palace Kitchens,33.460
12,712-45-1867,19.99,Silicon Valley Gastronomic Treats,23.988
13,722-51-5454,2.99,The Gourmet Microwave,28.704
14,724-80-9391,21.59,Computer Phobic AND Non-Phobic Individuals: Be...,43.180
15,807-91-6654,20.95,"Onions, Leeks, and Garlic: Cooking Secrets of ...",83.800
16,899-46-2035,10.95,Is Anger the Enemy?,141.912
17,998-72-3567,7.00,Life Without Fear,17.500